In [1]:
import pandas as pd
import sqlite3 as sql

db = '../database_data/shows.db'
conn = sql.connect(db)
cur = conn.cursor()

In [2]:
#import all csv files

actors = pd.read_csv("../database_data/populate_data/actors.csv")
users = pd.read_csv("../database_data/populate_data/users.csv")
reviews = pd.read_csv("../database_data/populate_data/reviews.csv")
genre = pd.read_csv("../database_data/populate_data/genre.csv")
rls_table = pd.read_csv("../database_data/populate_data/rls_table.csv")
movie = pd.read_csv("../database_data/populate_data/movie.csv")
genre_shows = pd.read_csv("../database_data/populate_data/movie_show.csv")
tv_shows = pd.read_csv("../database_data/populate_data/shows.csv")
all_comments = pd.read_csv("../database_data/populate_data/all_comment_info.csv")
comment_reply = pd.read_csv("../database_data/populate_data/comment_reply.csv")
down = pd.read_csv("../database_data/populate_data/down_vote.csv")
up = pd.read_csv("../database_data/populate_data/up_vote.csv")

In [3]:
del tv_shows["Unnamed: 0"]
del genre_shows["Unnamed: 0"]
del genre["Unnamed: 0"]
del movie["Unnamed: 0"]

In [4]:
genre_shows.rename(columns = {'movie_show_id':'show_id' }, inplace = True)

In [5]:
actors.rename(columns = {'age':'gender'}, inplace = True)

In [6]:
reviews.rename(columns = {'comments_id':'review_id'}, inplace = True)

In [7]:
down.rename(columns = {'down_vote':'num_down_vote'}, inplace = True)
up.rename(columns = {'up_vote':'num_up_vote'}, inplace = True)

In [8]:
actors_query = """
                    CREATE TABLE actors (
                    ID INT NOT NULL PRIMARY KEY,
                    first_name TEXT NOT NULL,
                    last_name TEXT NOT NULL,
                    gender TEXT,
                    origin TEXT,
                    birth_dates TEXT
                    )"""

cur.execute(actors_query)
actors.to_sql('actors', con = conn, index = False, if_exists="append")

In [9]:
users_query = """
                    CREATE TABLE users (
                    user_id INTEGER NOT NULL PRIMARY KEY,
                    email_address TEXT NOT NULL,
                    name TEXT,
                    password TEXT
                    )"""
cur.execute(users_query)
users.to_sql('users', con = conn, index = False, if_exists="append")

In [10]:
series_query = """
                    CREATE TABLE series (
                    show_id TEXT NOT NULL PRIMARY KEY,
                    title TEXT NOT NULL,
                    country TEXT,
                    release_year INTEGER,
                    is_adult TEXT,
                    num_seasons TEXT,
                    description TEXT, 
                    num_episodes INTEGER 
                    )"""

cur.execute(series_query)
tv_shows.to_sql('series', con = conn, index = False, if_exists="append")

In [11]:
movie_query = """
                    CREATE TABLE movie (
                    show_id TEXT NOT NULL PRIMARY KEY,
                    title TEXT NOT NULL,
                    country TEXT,
                    release_year INT,
                    is_adult TEXT,
                    duration INTEGER, 
                    description TEXT 
                    )"""

#make sure remove min in duration. can use triggers to only include in min
cur.execute(movie_query)
movie.to_sql('movie', con = conn, index = False, if_exists="append")

In [12]:
comment_info = """
                    CREATE TABLE comment_info (
                    comment_id TEXT NOT NULL PRIMARY KEY,
                    comment TEXT) """

cur.execute(comment_info)
all_comments.to_sql('comment_info', con = conn, index = False, if_exists="append")

In [13]:
reviews_query = """
                    CREATE TABLE review (
                    review_id INTEGER NOT NULL PRIMARY KEY,
                    show_id TEXT NOT NULL,
                    user_id INTEGER NOT NULL,
                    reviews TEXT,
                    ratings FLOAT,
                    FOREIGN KEY(user_id) REFERENCES users(user_id) ON DELETE CASCADE,
                    FOREIGN KEY(show_id) REFERENCES movie(show_id) ON DELETE CASCADE,
                    FOREIGN KEY(show_id) REFERENCES series(show_id) ON DELETE CASCADE
                    )"""

cur.execute(reviews_query)
reviews.to_sql('review', con = conn, index = False, if_exists="append")

In [14]:
down_vote = """
            CREATE TABLE down_vote (
                    review_id INTEGER NOT NULL PRIMARY KEY,
                    num_down_vote INTEGER NOT NULL,
                    FOREIGN KEY(review_id) REFERENCES review(review_id) ON DELETE CASCADE)"""

cur.execute(down_vote)
down.to_sql('down_vote', con = conn, index = False, if_exists="append")

In [15]:
up_vote = """
            CREATE TABLE up_vote (
                    review_id INTEGER NOT NULL PRIMARY KEY,
                    num_up_vote INTEGER NOT NULL,
                    FOREIGN KEY(review_id) REFERENCES review(review_id) ON DELETE CASCADE)"""

cur.execute(up_vote)
up.to_sql('up_vote', con = conn, index = False, if_exists="append")

In [16]:
comment_rls =  """
                    CREATE TABLE comment_rls (
                    parent_comment_id TEXT NOT NULL,
                    child_comment_id INTEGER NOT NULL,
                    review_id INTEGER NOT NULL,
                    user_id INTEGER NOT NULL, 
                    FOREIGN KEY(parent_comment_id) REFERENCES comment_info(comment_id) ON DELETE CASCADE,
                    FOREIGN KEY(child_comment_id) REFERENCES comment_info(comment_id) ON DELETE CASCADE,
                    FOREIGN KEY(review_id) REFERENCES review(review_id) ON DELETE CASCADE,
                    FOREIGN KEY(user_id) REFERENCES users(user_id) ON DELETE CASCADE
                    )"""

cur.execute(comment_rls)
comment_reply.to_sql('comment_rls', con = conn, index = False, if_exists="append")

In [17]:
rls_query = """
                    CREATE TABLE rls (
                    shows_id TEXT NOT NULL,
                    actors_id INTEGER NOT NULL,
                    FOREIGN KEY(actors_id) REFERENCES actors(actors_id) ON DELETE CASCADE,
                    FOREIGN KEY(shows_id) REFERENCES movie(show_id) ON DELETE CASCADE,
                    FOREIGN KEY(shows_id) REFERENCES series(show_id) ON DELETE CASCADE
                    )"""

cur.execute(rls_query)
rls_table.to_sql('rls', con = conn, index = False, if_exists="append")

In [18]:
genre_query = """
                    CREATE TABLE genre (
                    genre_type TEXT NOT NULL,
                    genre_id TEXT NOT NULL PRIMARY KEY
                    )"""

cur.execute(genre_query)
genre.to_sql('genre', con = conn, index = False, if_exists="append")

In [19]:
genre_shows_query = """
                    CREATE TABLE genre_shows (
                    show_id TEXT NOT NULL,
                    genre_id TEXT NOT NULL,
                    FOREIGN KEY(genre_id) REFERENCES series(genre_id) ON DELETE CASCADE,
                    FOREIGN KEY(show_id) REFERENCES movie(show_id) ON DELETE CASCADE,
                    FOREIGN KEY(show_id) REFERENCES series(show_id) ON DELETE CASCADE
                    )"""

cur.execute(genre_shows_query)
genre_shows.to_sql('genre_shows', con = conn, index = False, if_exists="append")

# VIEW Table Creation

View is created to accelerate common data retrival from a database. Hence, we'll be creating some to compliment query database applications.

In [20]:
movie_ratings_view = """
              CREATE VIEW IF NOT EXISTS movie_ratings AS
              SELECT m.show_id, m.title AS movie_titles, ROUND(AVG(r.ratings),2) AS avg_rating
              FROM movie AS m
              INNER JOIN review AS r ON r.show_id = m.show_id
              GROUP BY m.show_id;""" 

cur.execute(movie_ratings_view)

In [21]:
shows_ratings_view = """
              CREATE VIEW IF NOT EXISTS show_ratings AS
              SELECT s.show_id, s.title AS show_titles, ROUND(AVG(r.ratings),2) AS avg_rating
              FROM series AS s
              INNER JOIN review AS r ON s.show_id = r.show_id
              GROUP BY s.show_id;""" 

cur.execute(shows_ratings_view)

In [22]:
show_review_view = """
                    CREATE VIEW IF NOT EXISTS show_review AS
                    SELECT m.show_id, m.title, SUM(uv.num_up_vote - dv.num_down_vote) AS review_score
                    FROM movie AS m
                    INNER JOIN review AS r ON m.show_id == r.show_id
                    INNER JOIN up_vote AS uv ON uv.review_id == r.review_id
                    INNER JOIN down_vote AS dv ON dv.review_id == r.review_id
                    GROUP BY m.show_id
                    """

cur.execute(show_review_view)

# Triggers

#### Email Verification

In [23]:
email_validation = """
                CREATE TRIGGER validate_email_before_insert_users 
                BEFORE INSERT ON users
                BEGIN
                SELECT CASE
                    WHEN NEW.email NOT LIKE '%_@__%.__%' THEN
                    RAISE (ABORT,'Invalid email address')
                  END;
               END;"""

cur.execute(email_validation)

#### New email logs

In [24]:
eml_log = """
          CREATE TABLE email_update_logs (
          id INTEGER PRIMARY KEY,
          user_id INTEGER,
          old_email TEXT,
          new_email TEXT,
          user_action TEXT,
          created_at TEXT,
          FOREIGN KEY (user_id) REFERENCES users(user_id));"""

cur.execute(eml_log)

In [25]:
email_before = """
        CREATE TRIGGER log_email_after_update AFTER UPDATE ON users
        WHEN old.email_address <> new.email_address
            BEGIN
            INSERT INTO email_update_logs (
                user_id,
                old_email,
                new_email,
                user_action,
                created_at)
            VALUES (
                user_id,
                old.email_address,
                new.email_address,
                'UPDATE',
                DATETIME('NOW')) ;
            END;"""

cur.execute(email_before)

#### Account Creation

In [26]:
before_insert_account = """
                CREATE TRIGGER bef_insert_user BEFORE INSERT ON users
                BEGIN
                   SELECT CASE
                   WHEN ((SELECT u.email_address 
                          FROM users AS u 
                          WHERE u.email_address = NEW.email_address) IS NOT NULL)
                   THEN RAISE(FAIL, 'ERROR: This email address has been registered')
                   END;
                END;"""

cur.execute(before_insert_account)

In [27]:
after_insert_account = """
        CREATE TRIGGER log_email_after_insert AFTER INSERT ON users
            BEGIN
            INSERT INTO email_update_logs (
                user_id,
                old_email,
                new_email,
                user_action,
                created_at)
            VALUES (
                user_id,
                "Not Available",
                 new.email_address,
                'New Account',
                DATETIME('NOW')) ;
            END;"""
cur.execute(after_insert_account)

#### New shows

In [28]:
before_insert_movie = """
                CREATE TRIGGER bef_insert_movie BEFORE INSERT ON movie
                BEGIN
                   SELECT CASE
                   WHEN NEW.duration < 40
                       THEN RAISE(FAIL, 'ERROR: Duration should be in minutes')
                   WHEN new.release_year > CAST(strftime('%Y', DATETIME("NOW")) AS INT)
                       THEN RAISE(FAIL, "ERROR: Movie cannot be released in the future")
                   END;
                END;"""

cur.execute(before_insert_movie)

In [29]:
before_insert_series = """
                CREATE TRIGGER bef_insert_series BEFORE INSERT ON series
                BEGIN
                   SELECT CASE
                   WHEN NEW.num_of_seasons > 40
                       THEN RAISE(FAIL, 'ERROR: Duration should be in seasons')
                   WHEN new.release_year > CAST(strftime('%Y', DATETIME("NOW")) AS INT)
                       THEN RAISE(FAIL, "ERROR: Series cannot be released in the future")
                   END;
                END;"""

cur.execute(before_insert_series)

# Queries

1. top 100 movies and shows
2. worst rated uk movies
3. top movies with highest engangement
4. top reviews

1. update movie

In [30]:
# Main function for running SQL queries
def run_query(q):
    # Connect to the database
    with sql.connect(db) as conn:
        return pd.read_sql(q,conn)
    
# Function to show all the tables present in the database.
def show_tables():
    q = '''
        SELECT
            name
        FROM sqlite_master
        WHERE type IN ("table","view");
        '''
    return run_query(q)

# Function to count how many rows in each table
def get_table_row_count(tablename):
    q = '''
        SELECT
            COUNT(1)
        FROM %s;
        ''' % tablename
    return run_query(q)["COUNT(1)"][0]

tables = show_tables()
tables["row_count"] = [get_table_row_count(t) for t in tables["name"]]

tables

                 name  row_count
0              actors        800
1               users       9000
2              series       2676
3               movie       6131
4        comment_info     400006
5              review      50000
6           down_vote      50000
7             up_vote      50000
8         comment_rls     200057
9                 rls     176140
10              genre         42
11        genre_shows      19323
12      movie_ratings       6112
13       show_ratings       2666
14        show_review       6112
15  email_update_logs          0

#### Top 100 Movies and Shows

In [31]:
first_query = """
            WITH shows_movies AS (
                    SELECT *, "movie" AS type
                    FROM movie_ratings AS mr

                UNION
                    SELECT *, "show" AS type
                    FROM show_ratings AS sr

                )
                
                SELECT sm.movie_titles AS title, sm.avg_rating, sm.type
                FROM shows_movies AS sm
                ORDER by sm.avg_rating DESC
                LIMIT 100"""

run_query(first_query)

                                    title  avg_rating   type
0                                Scream 2        9.96  movie
1                             Coach Snoop        9.89   show
2                      We Belong Together        9.83  movie
3                        The Wishing Tree        9.77  movie
4                              Lost Girls        9.76  movie
..                                    ...         ...    ...
95                                  Tread        8.31  movie
96    The Dark Crystal: Age of Resistance        8.31   show
97          All's Well, End's Well (2009)        8.31  movie
98                             The Dancer        8.31  movie
99  The Misadventures of Hedi and Cokeman        8.30  movie

[100 rows x 3 columns]

#### Worst rated UK movies

In [32]:
second_query = """
                SELECT mr.movie_titles, mr.avg_rating
                FROM movie_ratings as mr
                INNER JOIN movie as m ON m.show_id == mr.show_id
                WHERE m.country = "United Kingdom"
                ORDER BY 2 ASC
                LIMIT 10
                """

run_query(second_query)

                              movie_titles  avg_rating
0                              Last Breath        0.55
1                             Hot Property        0.60
2                                Slow West        0.77
3                               Figaro Pho        1.50
4  Secrets of Her Majesty's Secret Service        1.67
5            David Brent: Life on the Road        1.72
6                               Effie Gray        1.82
7                                 The King        1.85
8            Shawn Mendes: Live in Concert        2.04
9                         Sitting in Limbo        2.05

#### Top review movie

In [33]:
top_review_query = """
                    SELECT title , review_score FROM show_review 
                    ORDER BY review_score DESC
                    LIMIT 20
                    """

run_query(top_review_query)

                                                title  review_score
0                                             Honey 2        102500
1                     David Batra: Elefanten i rummet         94770
2                                       Ice Guardians         82086
3                                                Jada         71905
4                              Blue, Painful, Fragile         70071
5                                       Tango With Me         69120
6                                       Cold Mountain         67987
7                                     The Arbitration         66352
8                                   Uncle Naji in UAE         65802
9                                      Bombay Talkies         65709
10                               The Price of Success         65376
11                                              Eerie         65160
12               Rhys Nicholson Live at the Athenaeum         64952
13       FYRE: The Greatest Party That Never Happened         64682
14                  Monty Python: The Meaning of Live         64060
15                           Midnight at the Magnolia         63729
16  InuYasha the Movie: Affections Touching Across...         63716
17                                              Trash         62975
18                                           Due Date         62630
19                                 The Age of Shadows         62603

#### Top Movies with Highest Engagement

In [34]:
engagement = """
    SELECT m.show_id , m.title, COUNT(rls.review_id) as engagement_score
    FROM movie AS m
    INNER JOIN review AS r ON r.show_id == m.show_id
    INNER JOIN comment_rls AS rls ON rls.review_id == r.review_id
    GROUP BY m.show_id
    ORDER BY 3 DESC
    LIMIT 20
"""
run_query(engagement)

,show_id,title,engagement_score
0,s1086,Night in Paradise,93
1,s2366,Alexandria ... Why?,88
2,s6310,Biggie & Tupac,86
3,s503,Tango With Me,84
4,s1672,The App That Stole Christmas,80
5,s2687,Chris D'Elia: No Pain,79
6,s7995,Shakti: The Power,77
7,s2324,The Mirror Boy,77
8,s465,Gunpowder Milkshake,76
9,s2720,David Batra: Elefanten i rummet,76
10,s1177,Any Crybabies Around?,76
11,s3377,My Next Guest with David Letterman and Shah Ru...,75
12,s3137,Game,75
13,s1608,Hazel Brugger: Tropical,74
14,s7394,Mandi,72
15,s6004,24 Hours to Live,72
16,s868,The Last Days,70
17,s5638,Clinical,70
18,s5554,Bridget Christie: Stand Up for Her,70
19,s3007,Motichoor Chaknachoor,70

# Update

In [35]:
cur.close()